workstation/openfoam-master-tutorials/tutorials/incompressible/simpleFoam/bump2D/setups.orig/common/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

method          hierarchical;

coeffs
{
    n           (8 1 1);
    // delta       0.001;  //< default value = 0.001
    // order       xyz;    //< default order = xyz
}


// ************************************************************************* //
